AI4CFD_export/freecad_addon/AI4CFD/vendor/CfdOF/Data/TestFiles/cases/DamBreak3D/case/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    open
    {
        type        calculated;
        value       $internalField;
    }

    wall
    {
        type        nutkWallFunction;
        value       uniform 0;
    }

    defaultFaces
    {
        type        nutkWallFunction;
        value       uniform 0;
    }


    redistributeHelper
    {
        #include "include/helperPatchFieldType";
        value $internalField;
    }
}

// ************************************************************************* //
