AI4CFD_export/freecad_addon/AI4CFD/vendor/CfdOF/Data/TestFiles/cases/DamBreak3D/case/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000.0;

boundaryField
{

    open
    {
        type        totalPressure;
        p0          uniform 100000.0;
        value       $internalField;
    }

    wall
    {
        type        fixedFluxPressure;
        value       $internalField;
    }

    defaultFaces
    {
        type        fixedFluxPressure;
        value       $internalField;
    }


    redistributeHelper
    {
        #include "include/helperPatchFieldType";
        value $internalField;
    }
}

// ************************************************************************* //
